# Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

# Step 2. Create 3 differents Series, each of length 100, as follows:

1. The first a random number from 1 to 4

In [5]:
a = pd.Series(np.random.randint(1, 5, size = 100, dtype = 'l'))
a

0     1
1     1
2     1
3     4
4     4
     ..
95    2
96    4
97    1
98    4
99    1
Length: 100, dtype: int32

2. The second a random number from 1 to 3

In [7]:
b = pd.Series(np.random.randint(1, 4, size = 100, dtype = 'l'))
b

0     3
1     1
2     2
3     2
4     3
     ..
95    3
96    2
97    3
98    2
99    3
Length: 100, dtype: int32

3. The third a random number from 10,000 to 30,000

In [9]:
c = pd.Series(np.random.randint(10000, 30000, size = 100, dtype = 'l'))
c

0     18615
1     20786
2     22660
3     28285
4     22107
      ...
95    12457
96    20999
97    16371
98    28386
99    14125
Length: 100, dtype: int32

# Step 3. Let's create a DataFrame by joinning the Series by column

In [10]:
df = pd.concat([a, b, c], axis = 1)
df

    0  1      2
0   1  3  18615
1   1  1  20786
2   1  2  22660
3   4  2  28285
4   4  3  22107
.. .. ..    ...
95  2  3  12457
96  4  2  20999
97  1  3  16371
98  4  2  28386
99  1  3  14125

[100 rows x 3 columns]

# Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [11]:
df.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace = True)
df

    bedrs  bathrs  price_sqr_meter
0       1       3            18615
1       1       1            20786
2       1       2            22660
3       4       2            28285
4       4       3            22107
..    ...     ...              ...
95      2       3            12457
96      4       2            20999
97      1       3            16371
98      4       2            28386
99      1       3            14125

[100 rows x 3 columns]

# Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [12]:
bigcolumn = pd.concat([a, b, c], axis = 0)
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))
bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       1
1       1
2       1
3       4
4       4
..    ...
95  12457
96  20999
97  16371
98  28386
99  14125

[300 rows x 1 columns]

# Step 6. Oops, it seems it is going only until index 99. Is it true?

In [13]:
len(bigcolumn)

300

# Step 7. Reindex the DataFrame so it goes from 0 to 299

In [14]:
bigcolumn.reset_index(drop = True, inplace = True)
bigcolumn

         0
0        1
1        1
2        1
3        4
4        4
..     ...
295  12457
296  20999
297  16371
298  28386
299  14125

[300 rows x 1 columns]